# 22 Group By: extraer valor con variables categóricas

In [1]:
import pandas as pd
import numpy as np
pd.__version__

'1.3.1'

In [2]:
pd.options.display.float_format = '{:,.2f}'.format

In [3]:
import seaborn as sns

In [4]:
df = sns.load_dataset('tips')
df

     total_bill  tip     sex smoker   day    time  size
0         16.99 1.01  Female     No   Sun  Dinner     2
1         10.34 1.66    Male     No   Sun  Dinner     3
2         21.01 3.50    Male     No   Sun  Dinner     3
3         23.68 3.31    Male     No   Sun  Dinner     2
4         24.59 3.61  Female     No   Sun  Dinner     4
..          ...  ...     ...    ...   ...     ...   ...
239       29.03 5.92    Male     No   Sat  Dinner     3
240       27.18 2.00  Female    Yes   Sat  Dinner     2
241       22.67 2.00    Male    Yes   Sat  Dinner     2
242       17.82 1.75    Male     No   Sat  Dinner     2
243       18.78 3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [5]:
df['prct_tip'] = df['tip']/df['total_bill']

In [6]:
df['ones'] = 1

In [9]:
df.head(5)

   total_bill  tip     sex smoker  day    time  size  prct_tip  ones
0       16.99 1.01  Female     No  Sun  Dinner     2      0.06     1
1       10.34 1.66    Male     No  Sun  Dinner     3      0.16     1
2       21.01 3.50    Male     No  Sun  Dinner     3      0.17     1
3       23.68 3.31    Male     No  Sun  Dinner     2      0.14     1
4       24.59 3.61  Female     No  Sun  Dinner     4      0.15     1

conteo del total de peronas que componen esos grupos:

In [10]:
df_g = df.groupby(['sex','smoker'])[['ones']].sum()
df_g

               ones
sex    smoker
Male   Yes       60
       No        97
Female Yes       33
       No        54

agrupando en el nivel del género

In [11]:
# sacando el porcentaje de fumadores por género
# a cada grupo le aplica la función 
# para los hombre, x toma el valor de 60 y 97
df_g.groupby(level=0).apply(

lambda x:
x / x.sum() * 100

)

               ones
sex    smoker
Male   Yes    38.22
       No     61.78
Female Yes    37.93
       No     62.07

El 38% de hombres fuma y el 61 no.

Otra forma de obtener valor de nuestros datos, podemos transformar nuestras variables numéricas a una variable categórica, a pesar de ser continua, por ello usamos `cut` para crear las categorías por bins, osea por intervalos.

In [12]:
pd.cut(df['total_bill'],bins = 3)

0       (3.022, 18.983]
1       (3.022, 18.983]
2      (18.983, 34.897]
3      (18.983, 34.897]
4      (18.983, 34.897]
             ...
239    (18.983, 34.897]
240    (18.983, 34.897]
241    (18.983, 34.897]
242     (3.022, 18.983]
243     (3.022, 18.983]
Name: total_bill, Length: 244, dtype: category
Categories (3, interval[float64, right]): [(3.022, 18.983] < (18.983, 34.897] < (34.897, 50.81]]

In [13]:
pd.cut(df['total_bill'],bins = 3).value_counts()

(3.022, 18.983]     140
(18.983, 34.897]     88
(34.897, 50.81]      16
Name: total_bill, dtype: int64

Podemos definir el ancho de nuestras categorías, especificando `bins ` como una lista:

In [15]:
pd.cut(df['total_bill'], bins = [3,18,35,60]).value_counts()

(3, 18]     127
(18, 35]    101
(35, 60]     16
Name: total_bill, dtype: int64

podemos crear una columna nueva con éstso datos categóricos:

In [ ]:
df['bin_total'] = pd.cut(df['total_bill'],bins = [3,18,35,60])

In [17]:
df.head(5)

   total_bill  tip     sex smoker  day    time  size  prct_tip  ones bin_total
0       16.99 1.01  Female     No  Sun  Dinner     2      0.06     1   (3, 18]
1       10.34 1.66    Male     No  Sun  Dinner     3      0.16     1   (3, 18]
2       21.01 3.50    Male     No  Sun  Dinner     3      0.17     1  (18, 35]
3       23.68 3.31    Male     No  Sun  Dinner     2      0.14     1  (18, 35]
4       24.59 3.61  Female     No  Sun  Dinner     4      0.15     1  (18, 35]

In [18]:
df.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
prct_tip       float64
ones             int64
bin_total     category
dtype: object

ésta nueva categoría podemos agruparla. veamos la relación del monto con el tipo de comida (comida o cena). y hagamos el porcentaje por valor de la cuenta, agrupado por tipo de comida. Usamos la misma función lambda que usamos anteriormente.

In [19]:
df.groupby(['time','bin_total'])[['ones']].count()

                  ones
time   bin_total
Lunch  (3, 18]      45
       (18, 35]     21
       (35, 60]      2
Dinner (3, 18]      82
       (18, 35]     80
       (35, 60]     14

In [20]:
df.groupby(['time','bin_total'])[['ones']].count().groupby(level=0).apply(

lambda x:
x / x.sum() * 100

)

                  ones
time   bin_total
Lunch  (3, 18]   66.18
       (18, 35]  30.88
       (35, 60]   2.94
Dinner (3, 18]   46.59
       (18, 35]  45.45
       (35, 60]   7.95

Vemos que menos del 3 % de las cuentas superan los 35 dolares, durante la comida, y que durante la cena, el monto aumenta.

## 23 Pivot

In [ ]:
df.groupby(['sex','time'])[['total_bill']].mean()

               total_bill
sex    time
Male   Lunch       18.048
       Dinner      21.461
Female Lunch       16.339
       Dinner      19.213

In [ ]:
df_gp = df.groupby(['sex','time'])[['total_bill']].mean().reset_index()
df_gp

      sex    time  total_bill
0    Male   Lunch      18.048
1    Male  Dinner      21.461
2  Female   Lunch      16.339
3  Female  Dinner      19.213

In [ ]:
df_gp.pivot_table(values='total_bill', index='sex', columns='time')

time    Lunch  Dinner
sex
Male   18.048  21.461
Female 16.339  19.213

![](https://pandas-docs.github.io/pandas-docs-travis/_images/reshaping_pivot.png)

In [ ]:
df.pivot_table(values='total_bill', index='sex', columns='time')

time    Lunch  Dinner
sex
Male   18.048  21.461
Female 16.339  19.213

In [ ]:
df.pivot_table(values='total_bill', index='sex', columns='time', aggfunc=np.median)

time    Lunch  Dinner
sex
Male   16.580  19.630
Female 13.420  17.190

In [ ]:
df_pivot = df.pivot_table(values='total_bill', index='sex', columns='time', aggfunc=[np.median,np.std])
df_pivot

       median          std
time    Lunch Dinner Lunch Dinner
sex
Male   16.580 19.630 7.953  9.461
Female 13.420 17.190 7.501  8.202

In [ ]:
df_pivot.unstack().reset_index()

  level_0    time     sex      0
0  median   Lunch    Male 16.580
1  median   Lunch  Female 13.420
2  median  Dinner    Male 19.630
3  median  Dinner  Female 17.190
4     std   Lunch    Male  7.953
5     std   Lunch  Female  7.501
6     std  Dinner    Male  9.461
7     std  Dinner  Female  8.202